---
type: AssetPropertyString
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 2
tags: [revit-api, class]
---

# AssetPropertyString

`Autodesk.Revit.DB.Visual.AssetPropertyString` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidValue | 2018.1 | `public bool IsValidValue ( string value )` |
| Property | Value | — | `public string Value { get ; set ; }` |